Config/Catalogs/УдалитьНастройкиОбменаФРМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УдалитьНастройкиОбменаФРМО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбменЧерезРегион</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиентаИПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/НастройкиОбменаФРМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаФРМО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОИД</Name>
					<Comment>Код OID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПодключенияФРМО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКлиентаИПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОбменЧерезРегион</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/УдалитьНастройкиОбменаФРМО/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Подключение = ?(Объект.ОбменЧерезРегион, 1, 0);
	УстановитьВидимостьНастроек();
	УстановитьОтображениеЗащищенногоСоединения();
	УстановитьДоступностьПросмотраПароля(Ложь);
	УправлениеМаскированиемПароля(Истина);
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ВосстановитьПарольИзБезопасногоХранилища()
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьПарольВБезопасноеХранилище(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПарольИзменен = Ложь;
	//УстановитьДоступностьПросмотраПароля(Ложь);
	//УправлениеМаскированиемПароля(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодключениеПриИзменении(Элемент)
	
	Объект.ОбменЧерезРегион = (Подключение = 1);
	УстановитьВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервисаПриИзменении(Элемент)
	
	ФорматироватьАдресСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПриИзмененииПароля();
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация3ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.НастройкиОбменаФРМО.ФормаСписка");
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗащищенноеСоединение(Команда)
	
	Объект.ЗащищенноеСоединение = Не Объект.ЗащищенноеСоединение;
	УстановитьОтображениеЗащищенногоСоединения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	УправлениеМаскированиемПароля(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПароль(Команда)
	
	УправлениеМаскированиемПароля(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьНастроек()
	
	Элементы.ГруппаНастройкиИПС.Видимость = Не Объект.ОбменЧерезРегион;
	Элементы.Логин.Видимость = Объект.ОбменЧерезРегион;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеЗащищенногоСоединения()
	
	Элементы.ВыключитьЗащищенноеСоединение.Видимость = Объект.ЗащищенноеСоединение;
	Элементы.ВключитьЗащищенноеСоединение.Видимость = Не Объект.ЗащищенноеСоединение;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматироватьАдресСервиса()
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Объект.АдресСервиса);
	
	Если ЗначениеЗаполнено(СтруктураURI.Схема) Тогда
		Объект.ЗащищенноеСоединение = (СтруктураURI.Схема = "https");
		УстановитьОтображениеЗащищенногоСоединения();
	КонецЕсли;
	
	Если Объект.ОбменЧерезРегион И ЗначениеЗаполнено(СтруктураURI.Логин) Тогда
		Объект.Логин = СтруктураURI.Логин;
		Пароль = СтруктураURI.Пароль;
		ПриИзмененииПароля();
	КонецЕсли;
	
	ЧастиАдреса = Новый Массив; 
	Если ЗначениеЗаполнено(СтруктураURI.Хост) Тогда
		ЧастиАдреса.Добавить(СтруктураURI.Хост);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураURI.ПутьНаСервере) Тогда
		ПутьНаСервере = СтруктураURI.ПутьНаСервере;
		Пока СтрЗаканчиваетсяНа(ПутьНаСервере, "/") Цикл
			ПутьНаСервере = Лев(ПутьНаСервере, СтрДлина(ПутьНаСервере) - 1);
		КонецЦикла;
		Если ЗначениеЗаполнено(ПутьНаСервере) Тогда
			ЧастиАдреса.Добавить(ПутьНаСервере);
		КонецЕсли;
	КонецЕсли;
	
	Объект.АдресСервиса = СтрСоединить(ЧастиАдреса, "/");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПароля()
	
	ПарольИзменен = Истина;
	УстановитьДоступностьПросмотраПароля(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПросмотраПароля(Доступно)
	
	Элементы.СкрытьПароль.Доступность = Доступно;
	Элементы.ПоказатьПароль.Доступность = Доступно;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМаскированиемПароля(РежимПароля)
	
	Элементы.Пароль.РежимПароля = РежимПароля;
	Элементы.СкрытьПароль.Видимость = Не РежимПароля;
	Элементы.ПоказатьПароль.Видимость = РежимПароля;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПарольИзБезопасногоХранилища()
	
	УстановитьПривилегированныйРежим(Истина);
	ПарольПрочитанный = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	Пароль = ?(ЗначениеЗаполнено(ПарольПрочитанный), ЭтотОбъект.УникальныйИдентификатор, "");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПарольВБезопасноеХранилище(ТекущийОбъект)
	
	Если Не ПарольИзменен Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыйПароль = ?(ЗначениеЗаполнено(Пароль), Пароль, Неопределено);
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, СохраняемыйПароль);
	УстановитьПривилегированныйРежим(Ложь);
	//Пароль = ?(ЗначениеЗаполнено(СохраняемыйПароль), ЭтотОбъект.УникальныйИдентификатор, "");
	
КонецПроцедуры

#КонецОбласти
